# В магазинах имеются следующие товары.
# Магнит – молоко, соль, сахар.
# Пятерочка – мясо, молоко, сыр.
# Перекресток – молоко, творог, сыр, сахар.
# Определить:
# 1. в каких магазинах нельзя приобрести сыр.
# 2. в каких магазинах можно приобрести одновременно молоко и сахар.
# 3. в каких магазинах можно приобрести соль.

# Множества
magnit = {"Соль", "Молоко", "Сахар"}
pyatka = {"Мясо", "Молоко", "Сыр"}
prkrst = {"Молоко", "Творог", "Сыр", "Сахар"}

# Список
stores = {
    "Магнит": magnit,
    "Пятерочка": pytka,
    "Перекресток": prkrst
}

# Задание 1

